app/Repositories/CardRepository.php

    public function index(){
        $data['cards'] = Card::paginate(50);
---
select * from `cards` limit 50 offset 0
select count(*) as aggregate from `cards`

    public function show(int $id){
        $data['statuses'] = Enums::CARD_STATUSES;
        $data['title'] = 'CARD DETAILS';
        $data['card'] = Card::find($id);
---
select * from `cards` where `cards`.`id` = 1 limit 1